In [17]:
x=12
y=34
z=y-x
print(z)

22

In [18]:
y=34
Employee_Id = 115169
print(Employee_Id)
#type(Employee_ID)

115169

In [19]:
z=x+y

In [20]:
print(x,y,z)

12 34 46

In [21]:
(5656+1.2+11.56)**2//2

16067419.0

In [22]:
str_var1='Hello'
str_var2='Hello world I am learning Python'
print(str_var1, type(str_var1))
print(str_var2, type(str_var2))
print(str_var1, str_var2, type(str_var1), type(str_var2))

Hello <class 'str'>
Hello world I am learning Python <class 'str'>
Hello Hello world I am learning Python <class 'str'> <class 'str'>

In [23]:
datestr1 = '09/13/1973'
datestr2 = '09/13/2019'

import datetime
date1 = datetime.datetime.strptime(datestr1,'%m/%d/%Y')
date2 = datetime.datetime.strptime(datestr2,'%m/%d/%Y')
print(date1,date2)

1973-09-13 00:00:00 2019-09-13 00:00:00

In [24]:
datestr1 = '09-13-1973'
datestr2 = '09-13-2019'

import datetime
date1 = datetime.datetime.strptime(datestr1,'%m-%d-%Y')
date2 = datetime.datetime.strptime(datestr2,'%m-%d-%Y')
print(date1,date2)

1973-09-13 00:00:00 2019-09-13 00:00:00

In [25]:
datestr1 = '13 Sep 1973'
datestr2 = '13 Sep 2019'

import datetime
date1 = datetime.datetime.strptime(datestr1,'%d %b %Y')
date2 = datetime.datetime.strptime(datestr2,'%d %b %Y')
print(date1,date2)

1973-09-13 00:00:00 2019-09-13 00:00:00

In [26]:
datestr1 = '13 September 1973'
datestr2 = '13 September 2019'

import datetime
date1 = datetime.datetime.strptime(datestr1,'%d %B %Y')
date2 = datetime.datetime.strptime(datestr2,'%d %B %Y')
print(date1,date2)

1973-09-13 00:00:00 2019-09-13 00:00:00

In [27]:
datestr1 = '13 September 73'
datestr2 = '13 September 19'

import datetime
date1 = datetime.datetime.strptime(datestr1,'%d %B %y')
date2 = datetime.datetime.strptime(datestr2,'%d %B %y')
date3 = date2-date1
date4 = date3/365
date5 = date2.strftime('%d %B %y %m %d')

print(date1,date2)
print(date3)
print(date4)
print(date5)

1973-09-13 00:00:00 2019-09-13 00:00:00
16801 days, 0:00:00
46 days, 0:43:23.835616
13 September 19 09 13

In [28]:
listofmarks=[10,20,30,40,50]
print(listofmarks,type(listofmarks))
names=['man',200.300,100,'woman']
print(names)

[10, 20, 30, 40, 50] <class 'list'>
['man', 200.3, 100, 'woman']

In [29]:
import pandas
infile=pandas.read_csv(r'/Users/manick/Python Training/dataset/Book2.csv',encoding='iso-8859-1')
infile.info()
infile.head()
infile.tail()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 12 columns):
Jan      5 non-null float64
Feb      5 non-null float64
Mar      5 non-null float64
Apr      5 non-null float64
 May     5 non-null float64
 Jun     5 non-null float64
 Jul     5 non-null float64
 Aug     5 non-null float64
 Sep     5 non-null float64
 Oct     5 non-null float64
 Nov     5 non-null float64
 Dec     5 non-null float64
dtypes: float64(12)
memory usage: 608.0 bytes

,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,465.34,361.09,524.41,477.78,446.88,436.5,441.3,484.3,436.6,472.3,325.0,276.1
1,0.00,0.00,0.00,0.00,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.00,0.00,0.00,0.00,0.00,0.0,0.0,37.0,48.4,25.0,18.0,20.0
3,0.00,0.00,0.00,0.00,0.00,0.0,0.0,0.0,25.0,75.0,75.0,75.0
4,465.34,361.09,524.41,477.78,446.88,436.5,441.3,521.3,510.0,572.3,418.0,371.1

In [30]:
import pandas
infile=pandas.read_csv(r'/Users/manick/Python Training/dataset/Book2.csv',encoding='iso-8859-1')
infile.tail(1)

,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
4,465.34,361.09,524.41,477.78,446.88,436.5,441.3,521.3,510.0,572.3,418.0,371.1

In [31]:
import pandas
infile=pandas.read_csv(r'/Users/manick/Python Training/dataset/Book2.csv',encoding='iso-8859-1')
infile.iloc[[0,-1 , ]]

,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,465.34,361.09,524.41,477.78,446.88,436.5,441.3,484.3,436.6,472.3,325.0,276.1
4,465.34,361.09,524.41,477.78,446.88,436.5,441.3,521.3,510.0,572.3,418.0,371.1

In [32]:
import pandas
infile=pandas.read_csv(r'/Users/manick/Python Training/dataset/Book2.csv',encoding='iso-8859-1')
infile.iloc[[0]]

,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,465.34,361.09,524.41,477.78,446.88,436.5,441.3,484.3,436.6,472.3,325.0,276.1

In [33]:
import pandas
infile=pandas.read_csv(r'/Users/manick/Python Training/dataset/Book2.csv',encoding='iso-8859-1')
infile.iloc[0]

Jan      465.34
Feb      361.09
Mar      524.41
Apr      477.78
 May     446.88
 Jun     436.50
 Jul     441.30
 Aug     484.30
 Sep     436.60
 Oct     472.30
 Nov     325.00
 Dec     276.10
Name: 0, dtype: float64

In [34]:
import pandas
infile=pandas.read_csv(r'/Users/manick/Python Training/dataset/Book2.csv',encoding='iso-8859-1')
infile.iloc[:1]

,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,465.34,361.09,524.41,477.78,446.88,436.5,441.3,484.3,436.6,472.3,325.0,276.1

In [35]:
import pandas
infile=pandas.read_csv(r'/Users/manick/Python Training/dataset/Book2.csv',encoding='iso-8859-1')
infile.iloc[[0, 2], [1, 3]]

      Feb     Apr
0  361.09  477.78
2    0.00    0.00